Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: In other words, including a new file will change the line numbering of the main script file by only one line, namely that of the #Include line itself (except for compiled scripts, which merge their included files into one big script at the time of compilation).
ja: 言い換えれば、新しいファイルを含めると、メイン スクリプト ファイルの行番号は、#Include 行の1行分しか変更されません（ただし、コンパイル スクリプトは、コンパイル時にインクルード ファイルを 1 つの大きなスクリプトに統合します）。

source: In other words, it has the same effect as o := {}, o.%a% := b.
ja: つまり、o := {}, o.%a% := bと同じ効果を発揮するのです。

source: In other words, it often happens for new releases of software, until more users have downloaded that particular version.
ja: つまり、ソフトウェアの新しいリリースのために、より多くのユーザーがその特定のバージョンをダウンロードするまでは、しばしば起こることなのです。

source: In other words, it translates from `n to `r`n.
ja: つまり、`nから`r`nに変換するのです。

source: In other words, it will begin waiting for an entirely new hotstring.
ja: つまり、まったく新しいホットストリングを待つようになるのです。

source: In other words, it will launch when the current thread finishes or becomes interruptible, whichever comes first.
ja: つまり、現在のスレッドが終了するか、割り込み可能になるかのどちらか先になったときに起動する。

source: In other words, lines like (x.y)() and (x=y) && z() are interpreted as expressions.
ja: つまり、(x.y)()や(x=y) && z()のような行は、式として解釈されます。

source: In other words, methods such as DefineProp and HasOwnProp are not accessible by default.
ja: つまり、DefinePropや HasOwnPropといったメソッドは、デフォルトではアクセスできない。

source: In other words, moving a wildcard pattern such as "*.txt" is considered a success when it does not match any files.
ja: つまり、"*.txt"のようなワイルドカードパターンの移動は、どのファイルにもマッチしない場合に成功したとみなされます。

source: In other words, pressing the hotkey once will start the Loop.
ja: つまり、ホットキーを1回押せばLoopが開始されます。

source: In other words, rather than waiting for the timeout to expire, it immediately returns and continues execution of the script.
ja: つまり、タイムアウトが切れるのを待つのではなく、すぐに復帰してスクリプトの実行を継続するのです。

source: In other words, scripts are affected by the following limitations:
ja: つまり、スクリプトは以下のような制約の影響を受けます：

source: In other words, subsequent changes to the contents of the variable are not seen by existing hotkeys.
ja: 言い換えれば、変数の内容に対するその後の変更は、既存のホットキーでは見ることができません。

source: In other words, the Run function doesn't know where the program name ends and the parameters begin.
ja: つまり、Run関数は、プログラム名の終わりとパラメータの始まりを知らないのです。

source: In other words, the braces are implicit:
ja: つまり、中括弧は暗黙の了解なのです：

source: In other words, the class name of the window identifies what type of window it is.
ja: 言い換えれば、ウィンドウのクラス名は、それがどのタイプのウィンドウであるかを識別する。

source: In other words, the control is placed below/to the right of the previous control instead of at exactly the same position.
ja: つまり、コントロールは全く同じ位置ではなく、前のコントロールの下/右側に配置されます。

source: In other words, the cursor will be moved from its current position by X pixels to the right (left if negative) and Y pixels down (up if negative).
ja: つまり、カーソルは現在位置から右にXピクセル（負の場合は左）、下にYピクセル（負の場合は上）だけ移動します。

source: In other words, the cursor will be moved from its current position by X1 pixels to the right (left if negative) and Y1 pixels down (up if negative).
ja: つまり、カーソルは現在位置から右にX1ピクセル（マイナスの場合は左）、下にY1ピクセル（マイナスの場合は上）だけ移動することになります。

source: In other words, the expression preceding the parameter list is first evaluated to get a function object, then that object is called.
ja: つまり、パラメータリストの前にある式をまず評価して関数オブジェクトを取得し、そのオブジェクトを呼び出すのです。

source: In other words, the file to be launched must be an executable file.
ja: つまり、起動するファイルは実行可能なファイルである必要があります。

source: In other words, the hotstring will still fire even though the triggering abbreviation is never visible.
ja: つまり、トリガーとなる略語が一度も見えていなくても、ホットストリングは発射されるのです。

source: In other words, the parameter and the caller's variable both refer to the same contents in memory.
ja: つまり、パラメータも呼び出し側の変数も、メモリ上の同じ内容を参照しているのです。

source: In other words, the script will begin waiting for an entirely new hotstring, eliminating from consideration anything you previously typed (if this is undesirable, specify the line #Hotstring NoMouse anywhere in the script).
ja: つまり、スクリプトは全く新しいホットストリングを待ち始め、以前に入力したものは考慮されなくなります（これが望ましくない場合は、スクリプトのどこかに#Hotstring NoMouseという行を指定してください）。

source: In other words, the script will begin waiting for an entirely new hotstring, eliminating from consideration anything you previously typed.
ja: つまり、スクリプトは全く新しいホットストリングを待ち始め、以前に入力したものは考慮されなくなります。

source: In other words, the section above is only relevant for non-Latin based layouts such as Russian.
ja: つまり、上記のセクションは、ロシア語のような非ラテン語ベースのレイアウトにのみ関係します。

source: In other words, the stack of functions called directly or indirectly by a menu, timer, or hotkey function will all be returned from as though a Return were immediately encountered in each.
ja: つまり、メニュー、タイマー、ホットキーなどの関数が直接または間接的に呼び出すスタックは、それぞれでReturnがすぐに発生したかのように、すべてから返されます。

source: In other words, the string should be dividable into two halves:
ja: つまり、文字列は2つに分割できることが望ましいのです：

source: In other words, the string should be dividable into two halves: a time half and a date half.
ja: つまり、文字列は2つに分割できることが望ましいのです：時間半分、日付半分。

source: In other words, they take effect unconditionally, before the script ever executes any control flow statements.
ja: つまり、スクリプトが制御フロー文を実行する前に、無条件で効果を発揮するのです。

source: In other words, this code will not work:
ja: つまり、このコードは機能しない：

source: In other words, this example would not work as expected:
ja: つまり、この例では期待通りに動作しないことになります：

source: In other words, unquoted type names are no longer supported - type names must be enclosed in quote marks.
ja: つまり、引用符で囲まれていない型名はサポートされなくなり、型名は引用符で囲む必要があります。

source: In other words, when WinWait finds the window, it produces the window's ID as its result, and the script then stores this result in the variable.
ja: つまり、WinWaitがウィンドウを見つけると、その結果としてウィンドウのIDが生成され、スクリプトはこの結果を変数に格納するのです。

source: In other words, when a group of these statements is used as a whole, it does not always need to be enclosed in braces (however, some coding styles always include the braces, for clarity).
ja: つまり、これらの文のグループを全体として使用する場合、必ずしも中括弧で囲む必要はありません（ただし、コーディングスタイルによっては、わかりやすくするために中括弧を必ず入れるものもあります）。

source: In other words, when execution reaches a class definition during script startup, __Init and __New are called automatically, unless the class was already referenced by the script.
ja: 言い換えると、スクリプトの起動中に実行がクラス定義に達すると、__Initと__Newが自動的に呼び出されます。

source: In other words:
ja: 換言：

source: In our written instructions, we used indentation and numbering to group the statements.
ja: 説明書では、インデントとナンバリングを使ってステートメントをグループ化しました。

source: In particular, if the * or P suffix is used for output parameters, the output variable is required to be initialized.
ja: 特に、出力パラメータに接尾辞として * または P を使用した場合、出力変数の初期化が必要となる。

source: In particular, if you use SendMode "Play" with remapping, see SendPlay remapping limitations.
ja: 特に、SendMode "Play"をリマッピングで使用する場合は、SendPlayリマッピングの制限を参照してください。

source: In particular, normalization:
ja: 特に正規化だ：

source: In particular, support for the "logical" comparison mode is new.
ja: 特に、「論理」比較モードのサポートが新しくなりました。

source: In particular, the brace in Loop { is always block-begin, and If { and While { are always errors.
ja: 特に、Loop {の中括弧は常にブロック開始であり、If {と While {は常にエラーである。

source: In particular, the following behave differently to before when passed an integer:
ja: 特に、以下のものは整数を渡されたときの挙動が以前と異なります：

source: In particular, the following behave differently to before when passed an integer: R4, R8, Cy, Date.
ja: 特に、以下のものは整数を渡されたときの挙動が以前と異なります：R4、R8、Cy、Date。

source: In particular:
ja: 特に：

source: In practice, the end result is that the available components are as listed on the Levels tab, and in the same order.
ja: 実際には、最終的に利用可能なコンポーネントは、「レベル」タブにリストされたとおりで、同じ順番となる。

source: In preference to BlockInput, it is often better to use SendMode "Input" or SendMode "Play" so that keystrokes and mouse clicks become uninterruptible.
ja: BlockInputよりも、SendMode "Input"やSendMode "Play"を使用した方が、キー入力やマウスクリックが途切れることなく行える場合があります。

source: In previous versions of AutoHotkey, filenames of auto-included files were written to the file specified by OutFile, formatted as #Include directives.
ja: 以前のバージョンのAutoHotkeyでは、自動インクルードされたファイルのファイル名は、#Includeディレクティブとしてフォーマットされ、OutFileで指定されたファイルに書き込まれました。

source: In programming parlance, this is known as a "window handle" or HWND.
ja: プログラミングの用語では、これを「ウィンドウハンドル」またはHWNDと呼びます。

source: In rare cases, this may be due to the system running out of memory.
ja: まれに、システムのメモリ不足が原因の場合もある。

source: In short, it is safest to stick to names consisting of ASCII letters (which are case insensitive), digits and underscore, and to avoid using names that start with a digit.
ja: 要するに、ASCII文字（大文字小文字を区別しない）、数字、アンダースコアからなる名前にこだわり、数字から始まる名前は使わないようにするのが無難です。

source: In short, it is safest to stick to names consisting of ASCII letters (which are case-insensitive), digits and underscore, and to avoid using names that start with a digit.
ja: 要するに、ASCII文字（大文字小文字を区別しない）、数字、アンダースコアからなる名前にして、数字から始まる名前にしないようにするのが無難です。

source: In short, the parameter is passed by value.
ja: 要するに、パラメータは値で渡されるのです。

source: In short, this enables most functions to transparently work with long paths, but requires Windows 10 version 1607 or later.
ja: 要するに、これによりほとんどの機能が透過的に長いパスを扱うことができるようになりますが、Windows 10のバージョン1607以降が必要です。

source: In short:
ja: 要するにだ：

source: In simple cases like this, the easiest way to bypass the redirection of "System32" is to use "SysNative" instead.
ja: このような単純なケースでは、「System32」のリダイレクトを回避する最も簡単な方法は、代わりに「SysNative」を使用することです。

source: In some cases ErrorLevel was used for a secondary return value.
ja: ErrorLevelが二次的な戻り値として使用されるケースもあった。

source: In some cases a variable can be used in place of a label name.
ja: 場合によっては、ラベル名の代わりに変数を使うこともできる。

source: In some cases it can be useful to override this behaviour; for instance, to allow a remapped key to be used to trigger other hotkeys.
ja: 例えば、リマップキーを使って他のホットキーをトリガーできるようにするなど、この動作をオーバーライドすると便利な場合があります。

source: In some cases it may be sufficient for the method to delete itself, such as with this.DeleteProp('__New'); however, the first execution of __New might be for a subclass if one is nested in the base class or referenced during initialization of a static/class variable.
ja: 場合によっては、this.DeleteProp('__New')のように、メソッド自体を削除すれば十分かもしれません。しかし、__Newの最初の実行は、サブクラスが基本クラスに入れ子になっている場合や、静的/クラス変数の初期化中に参照される場合があります。

source: In some cases the code does not support continuation, and the option to continue should not be shown.
ja: コードが継続をサポートしていないケースもあり、継続の選択肢は表示しない方がよいでしょう。

source: In some cases this approach may backfire, as DllCall adds the W suffix only if no function could be found with the original name.
ja: DllCallは、元の名前の関数が見つからなかった場合にのみ、Wサフィックスを追加するため、この方法が裏目に出る場合もあります。

source: In some cases this avoids the need to retain the original object which was passed to SetTimer.
ja: 場合によっては、SetTimerに渡された元のオブジェクトを保持する必要性を回避できます。

source: In some cases when an object is used in a context where one was not expected, it might be treated as an empty string.
ja: オブジェクトが想定外の文脈で使用された場合、空文字列として扱われることがあります。

source: In some cases you might need to click "log off anyway" or "shut down anyway" if a script or program is preventing shutdown.
ja: スクリプトやプログラムがシャットダウンを妨げている場合は、「ログオフする」または「シャットダウンする」をクリックする必要がある場合があります。

source: In some cases, environment variables can be set with EnvSet before launching the program to affect its behaviour, or pass information to it.
ja: 場合によっては、プログラムを起動する前にEnvSetで環境変数を設定し、プログラムの動作に影響を与えたり、情報を渡したりすることができます。

source: In some cases, software bundled with the mouse must instead be used to control this feature.
ja: 場合によっては、マウスにバンドルされているソフトウェアを使用して、この機能を制御する必要があります。

source: In some cases, the entire purpose of the script may be carried out with global code.
ja: 場合によっては、スクリプトの目的全体をグローバルコードで遂行することもあります。

source: In some locales, it looks like 6/1/05 or 6/1/2005.
ja: 地域によっては、2005年6月1日または2005年6月1日のように見える。

source: In some locales, it looks like 6/1/2005.
ja: 地域によっては2005年6月1日のようだ。

source: In some locales, it looks like Wednesday, June 01, 2005.
ja: 地域によっては2005年6月1日（水）のようだ。

source: In some rare cases it may be necessary to pass an object to external code via DllCall or store it in a binary data structure for later retrieval.
ja: まれに、DllCallを介して外部コードにオブジェクトを渡したり、後で取り出すためにバイナリ・データ構造に格納したりする必要がある場合がある。

source: In spite of the built-in exception handling, it is still possible to crash a script with DllCall.
ja: 内蔵の例外処理にもかかわらず、DllCallでスクリプトをクラッシュさせることは可能です。

source: In such a case, RequestedCapacity need not be accurate:
ja: その場合、RequestedCapacityは正確である必要はない：

source: In such a case, RequestedCapacity need not be accurate: if the capacity is too small, performance is still improved and the variable will begin auto-expanding when the capacity has been exhausted.
ja: その場合、RequestedCapacityは正確である必要はない：容量が小さすぎる場合でも、パフォーマンスは改善され、容量がなくなると変数は自動拡張を開始する。

source: In such a case, it is not necessary to specify the System Modal or Task Modal options from the table above.
ja: この場合、上表からシステムモード、タスクモードのオプションを指定する必要はありません。

source: In such case, this License incorporates the limitation as if written in the body of this License.
ja: そのような場合、本許諾書は、本許諾書の本文に書かれているのと同じように、その制限を組み入れる。

source: In such cases, FileGetAttrib is preferred.
ja: このような場合は、FileGetAttribを使用することが望ましい。

source: In such cases, arr.%i% can be used to access an array element-property.
ja: このような場合、arr.%i%は配列の要素-プロパティにアクセスするために使用することができます。

source: In such cases, Obj.GetOwnPropDesc(Name).Value == Obj.%Name%.
ja: このような場合、Obj.GetOwnPropDesc(Name).Value == Obj.%Name%。

source: In such cases, CapsLock is suppressed by the IME and cannot be detected by AutoHotkey.
ja: このような場合、CapsLockはIMEによって抑制されてAutoHotkeyで検出することができません。

source: In such cases, consider using Value is Number or similar instead of Type.
ja: このような場合は、Typeの代わりにValue is Numberなどを使用することを検討してください。

source: In such cases, events for the main window (such as Close) do not pass an explicit Gui parameter, as this already contains a reference to the Gui.
ja: このような場合、メインウィンドウのイベント（閉じるなど）は、thisはすでにGuiへの参照を含んでいるため、明示的なGuiパラメータを渡すことはありません。

source: In such cases, execution is transferred into the catch statement or to the next statement after the try.
ja: このような場合、実行はcatch文に移されるか、tryの次の文に移される。

source: In such cases, increasing this setting causes the script to wait longer before giving up and displaying an error message.
ja: そのような場合、この設定を増やすと、スクリプトはより長く待機して、諦めてエラーメッセージを表示するようになります。

source: In such cases, it is usually desirable to:
ja: このような場合、通常は、以下のようにすることが望ましい。

source: In such cases, it is usually desirable to: 1) fire a hotstring even if it lacks the question mark option; 2) prevent a firing when something you type after clicking the mouse accidentally forms a valid abbreviation with what you typed before.
ja: このような場合、通常は、以下のようにすることが望ましい：1)ホットストリングがクエスチョンマークオプションを欠いていても発射します。2)マウスをクリックした後に入力したものが、誤って前に入力したものと有効な略語を形成した場合に発射されるのを防止します。

source: In such cases, the first approach shown above must be used, replacing 0x400C with the appropriate variant type.
ja: このような場合、0x400Cを適切なバリアントタイプに置き換えて、上記の最初の方法を使用する必要があります。

source: In such cases, the keystroke may still be processed by an Input lower on the stack.
ja: このような場合、キーストロークは、スタックの下位にある入力によって処理される可能性がある。

source: In such cases, the name stored in the variable is used to locate the target label.
ja: このような場合、変数に格納されている名前がターゲット・ラベルを探すのに使われる。

source: In such cases, the thread is aborted (if try is not used), but any asterisk variables are still updated.
ja: このような場合、スレッドは（tryが使用されていない場合）中止されますが、アスタリスク変数はまだ更新されます。

source: In that case, this refers to the class itself or a subclass.
ja: その場合、thisはクラスそのものかサブクラスを指す。

source: In that case, be careful not to confuse := (assignment) with = or == (comparison).
ja: その場合、:=（代入）と=や ==（比較）を混同しないように注意してください。

source: In that case, exiting the script won't necessarily be enough, as the operating system still thinks the key is being held down.
ja: その場合、スクリプトを終了しても、OSはキーが押されていると判断するため、必ずしも十分ではありません。

source: In that case, methods are defined as shown above, but without Prefix.
ja: その場合、メソッドは上記のように定義されるが、Prefixは含まれない。

source: In that case, omitting the W suffix causes the ANSI version to be called.
ja: その場合、Wサフィックスを省略すると、ANSIバージョンが呼び出されることになります。

source: In that case, the v1 files are left in the root of the installation directory, to avoid breaking any external tools or shortcuts that rely on their current path.
ja: その場合、カレントパスに依存する外部ツールやショートカットが壊れないように、v1ファイルはインストールディレクトリのルートに残される。

source: In that case, whenever the parameter is omitted, the corresponding variable will have no value.
ja: その場合、パラメータが省略されるたびに、対応する変数は値を持ちません。

source: In that string, N is the PCRE error number, M is the position of the offending character inside the regular expression, and description is the text describing the error.
ja: その文字列の中で、NはPCREのエラー番号、Mは正規表現内の問題のある文字の位置、descriptionはエラーを説明するテキストである。

source: In the Dash, select New script, type a name for the script (excluding the .ahk extension) and click Create or Edit.
ja: Dashで［新規スクリプト］を選択し、スクリプトの名前（拡張子.ahkを除く）を入力して、［作成］または［編集］をクリックします。

source: In the SendMessage line, replace the number 2 with -1 to turn on the monitor, or replace it with 1 to activate the monitor's low-power mode.
ja: SendMessage行で、モニターの電源をオンにする場合は数字の2を-1に、モニターの低電力モードを有効にする場合は数字を1に置き換えてください。

source: In the SendMessage line, replace the number 2 with -1 to turn the monitor on or replace it with 1 to activate the monitor's low-power mode.
ja: SendMessage行で、モニターの電源をオンにする場合は数字の2を-1に、モニターの低電力モードを有効にする場合は数字を1に置き換えてください。

source: In the above example, Callout is called once for each substring which matches the part of the pattern preceding the RegEx callout.
ja: 上記の例では、コールアウトは、RegExコールアウトの前にあるパターン部分にマッチする部分文字列ごとに1回ずつ呼び出される。

source: In the above example, the $ prefix is needed so that the hotkey can "send itself" without activating itself (which would otherwise trigger a warning dialog about an infinite loop).
ja: 上記の例では、ホットキーがアクティブにならずに「自分自身を送信」できるように、$接頭辞が必要です（そうしないと、無限ループに関する警告ダイアログが表示されます）。

source: In the above example, the abbreviation btw will be automatically replaced with "by the way" whenever you type it (however, by default you must type an ending character after typing btw, such as Space, ., or Enter).
ja: 上記の例では、btwという略語を入力すると、自動的に「by the way」に置き換えられます（ただし、デフォルトではbtwを入力した後に、Space、.、Enterなどのエンディングキャラクターを入力する必要があります）。

source: In the above, 0 indicates the first column (specify 1 for the second, 2 for the third, etc.) Also, 80 is the new width.
ja: 上記の場合、0は1列目を示します（2列目は1、3列目は2などを指定します）。また、80は新しい幅です。

source: In the above, replace 0 with the index of the icon (0 is used for the first icon) and replace <IconFile> with a URL, EXE, DLL, or ICO file.
ja: 上記で、0をアイコンのインデックスに置き換え（最初のアイコンには0が使われる）、その代わりに <IconFile>を、URL、EXE、DLL、ICO ファイルと一緒に送信します。

source: In the above, the braces serve to define a function body for each hotstring.
ja: 上記では、中括弧は各ホットストリングに対して関数体を定義する役割を果たします。

source: In the above, the braces serve to define a function body for the hotkey.
ja: 上記では、中括弧はホットキーの関数体を定義する役割を果たします。

source: In the absence of a preceding sign, a plus sign is assumed; for example, Wrap is the same as +Wrap.
ja: 先行する記号がない場合、プラス記号とみなされます。例えば、Wrapは +Wrapと同じです。

source: In the below example, the right Alt has become a prefix, which automatically allows it to modify all other keys as it normally would.
ja: 下の例では、右のAltがプレフィックスになり、自動的に他のすべてのキーを通常と同じように変更できるようになりました。

source: In the below example, the window will blink three times because each pair of flashes inverts then restores its appearance:
ja: 下の例では、ウィンドウが3回点滅していますが、これは1回の点滅が反転して元に戻るからです：

source: In the below example, you would hold down Numpad0 then press the second key to trigger the hotkey:
ja: 以下の例では、Numpad0を押した後、2番目のキーを押してホットキーを起動します：

source: In the case of a compiled script, the version that was originally used to compile it is reported.
ja: コンパイルされたスクリプトの場合、そのスクリプトをコンパイルするために最初に使用されたバージョンが報告される。

source: In the example above, "Blue" appears in quotes because it is a literal string.
ja: 上の例では、「Blue」はリテラル文字列なので引用符で囲まれています。

source: In the example above, class NestedClass constructs a Class object and stores it in ClassName.NestedClass.
ja: 上記の例では、class NestedClassが Classオブジェクトを構築し、ClassName.NestedClassに格納しています。

source: In the example above, test could be assigned some other function or value after it is defined, in which case the original function is lost and cannot be called via this property.
ja: 上記の例では、testが定義された後に他の関数や値が割り当てられる可能性があり、その場合、元の関数は失われ、このプロパティを通じて呼び出すことはできない。

source: In the example above, the FindColor() function never gets called if the ColorName variable is empty.
ja: 上の例では、ColorName変数が空の場合、FindColor()関数が呼ばれることはありません。

source: In the example above, the letter F will be underlined, which allows the user to press the shortcut key Alt+F to set keyboard focus to the first input-capable control that was added after the text control.
ja: 上の例では、Fという文字に下線が引かれ、ユーザーはショートカットキー Alt+Fを押すことで、テキストコントロールの後に追加された最初の入力可能なコントロールにキーボードフォーカスを設定することができるようになります。

source: In the example above, the use of & requires the caller to pass a VarRef, which usually corresponds to one of the caller's variables.
ja: 上記の例では、&を使用することで、呼び出し側がVarRefを渡す必要があります。

source: In the example below, you would hold down Numpad0 then press Numpad1 or Numpad2 to trigger one of the hotkeys:
ja: 以下の例では、Numpad0を押しながらNumpad1またはNumpad2を押して、ホットキーのいずれかをトリガーします：

source: In the example section of Edit you will find a script that allows you to change the default editor.
ja: Editのサンプルセクションには、デフォルトのエディタを変更するためのスクリプトがあります。

source: In the examples above, a series of lines is bounded at the top and bottom by a pair of parentheses.
ja: 上記の例では、一連の線は上下に括弧で囲まれている。

source: In the expression GetKeyState("Shift"), GetKeyState is actually a variable reference, although it usually refers to a read-only variable containing a built-in function.
ja: GetKeyState("Shift")という式では、GetKeyStateは実際には変数参照ですが、通常は組み込み関数を含む読み取り専用変数を指します。

source: In the first line above, notice that &Open is followed by Ctrl+O (with a tab character in between).
ja: 上の1行目では、&Openの後にCtrl+O（間にタブ文字が入る）が入っていることに注目してください。

source: In the following code, both lines are run only if MyVar equals 5:
ja: 以下のコードでは、MyVarが5に等しい場合にのみ、両方の行が実行される：

source: In the following code, the message box is only shown if MyVar equals 5.
ja: 以下のコードでは、MyVarが5に等しい場合にのみメッセージボックスが表示される。

source: In the following example, run_notepad_1 and run_notepad_2 both point at the Run line:
ja: 以下の例では、run_notepad_1とrun_notepad_2はともにRun行を指している：

source: In the following example, note that M must be capitalized:
ja: 以下の例では、Mは必ず大文字にすることに注意してください：

source: In the following example, note that M must be capitalized: M/d/yyyy h:mm tt
ja: 以下の例では、Mは必ず大文字にすることに注意してください：M/d/yyyy h:mm tt

source: In the following example, note the lack of commas between the last four items:
ja: 次の例では、最後の4つの項目の間にコンマがないことに注意してください：

source: In the following example, the control is disabled and its background is restored to the system default:
ja: 次の例では、コントロールが無効化され、その背景がシステムデフォルトに戻されています：

source: In the following example, the default icon from the second icon group is loaded with a width of 100 and an automatic height via "keep aspect ratio":
ja: 次の例では、2番目のアイコングループのデフォルトアイコンが、幅100、「縦横比を保つ」による自動高さで読み込まれます：

source: In the following example, the default icon from the second icon group is loaded with a width of 100 and an automatic height via "keep aspect ratio": MyPic.Value := "*icon2 *w100 *h-1 C:\My Application.exe".
ja: 次の例では、2番目のアイコングループのデフォルトアイコンが、幅100、「縦横比を保つ」による自動高さで読み込まれます：MyPic.Value := "*icon2 *w100 *h-1 C:\My Application.exe"。

source: In the following example, the default icon from the second icon group would be used:
ja: 次の例では、2番目のアイコングループのデフォルトアイコンが使用されることになります：

source: In the following example, the default icon from the second icon group would be used: MyGui.Add("Picture", "Icon2", "C:\My Application.exe").
ja: 次の例では、2番目のアイコングループのデフォルトアイコンが使用されることになります：MyGui.Add("Picture", "Icon2", "C:\My Application.exe")。
